# mehmetfatihdata

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

## 1.SORU

In [2]:
f1 = 1
f2 = 1
x = f1 + f2
fliste = [f1, f2]
while len(fliste)<10:
    fi1 = f1
    fi2 = f2
    f1 = fi2
    f2 = fi1 + fi2
    fliste.append(f2)
    x += fi2
#**********************
alist = []
for x in range (0,50):
   if x > 0:
       for y in range(2, x):
           if (x % y) == 0:
               break
       else:
           alist.append(x)

In [3]:
df = pd.DataFrame({'ASAL' : alist[0:10],
                   'FİBO':  fliste})
df.index = ("a", "b", "c", "d", "e", "f", "g", "h", "i", "j")
df

   ASAL  FİBO
a     1     1
b     2     1
c     3     2
d     5     3
e     7     5
f    11     8
g    13    13
h    17    21
i    19    34
j    23    55

## 2.SORU

In [4]:
titanic = pd.read_csv('train (2).csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
titanic.groupby(by='Sex').mean()['Survived']

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

## 3.SORU

In [6]:
young = titanic.loc[lambda df: titanic['Age'] < 30, :]
young_s_ratio = young.mean()["Survived"]
print ("30 Yaş Altı Yolcuların Kurtulma Oranı:", young_s_ratio)

30 Yaş Altı Yolcuların Kurtulma Oranı: 0.40625

In [7]:
young_sex_s_ratio = young.groupby(by="Sex").mean()["Survived"]
print ("30 Yaş Altı Yolcuların Cinsiyetlerine Göre Kurtulma Oranı:",young_sex_s_ratio)

30 Yaş Altı Yolcuların Cinsiyetlerine Göre Kurtulma Oranı: Sex
female    0.714286
male      0.215190
Name: Survived, dtype: float64

BİTTİ.